# Quarter-2 (Pandas)

# Concept of Series / DataFrame in Pandas

### Sources to Create Pandas Series:

    1) Direct data in the Series method
    2) Taking input from Numpy Array or Python List
    3) Taking input from Python Dictonary

In [176]:
import pandas as pd

## Pandas Series

In [247]:
# created Pandas 'Series'

obj = pd.Series([4, 7, -5, 3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

# Pandas Series has two things in one object
***Values***

***Index***

In [252]:
# Created 'series' named 'sales' in pandas

sales = pd.Series([100, 200, 100, 400])

In [254]:
# Values of series 'sales'

print(sales.values)

[100 200 100 400]

In [255]:
# Indexs of series 'sales'

print(sales.index)

RangeIndex(start=0, stop=4, step=1)

In [257]:
# Displaying series 'sales' as a whole

print(sales)

0    100
1    200
2    100
3    400
dtype: int64

In [260]:
# Setting customized indexes of rows

sales = pd.Series([100, 200, 100, 400], index = ['Jan', 'Feb', 'Mar','Apr'])
print(sales)

Jan    100
Feb    200
Mar    100
Apr    400
dtype: int64

In [261]:
# Setting internal name of Pandas 'series'

sales = pd.Series([100, 200, 100, 400], index = ['Jan', 'Feb', 'Mar','Apr'], name="4 month sales") 
print(sales)

Jan    100
Feb    200
Mar    100
Apr    400
Name: 4 month sales, dtype: int64

# Create a Pandas series to store a canteen data to hold values of how many sandwithes are sold each days (one week)

In [262]:
# variable 'sw' is created to store sandwith sales
#  customized indexes of week-days are assigned while creating series

sw = pd.Series([20, 30, 20, 25, 30, 40, 0], 
               index = ['mon', 'tue', 'wed', 'thr','fri', 'sat', 'sun'])
print(sw)

mon    20
tue    30
wed    20
thr    25
fri    30
sat    40
sun     0
dtype: int64

In [263]:
# Displaying desired indexes using different slicing methods like used in Pandas 'Numpy'

print(sw[1])
print(sw["tue"])
print(sw["sun"])

30
30
0

In [265]:
# Displaying desired row-indexes
# this will display row-index of two days 'thursday' & 'saturday' which are placed at index-3 & index-4

print(sw[  [3,5] ])

thr    25
sat    40
dtype: int64

In [266]:
# Displaying above by mentioning exact index-names rather than index numbers

print(sw[ [ "tue", "thr"] ])

tue    30
thr    25
dtype: int64

# For providing Multipe Indexes for Selecting Element in an Pandas Series, using array notation

In [271]:
# this will return boolean against each index-row having value more than 20

print(sw > 20)

mon    False
tue     True
wed    False
thr     True
fri     True
sat     True
sun    False
dtype: bool

In [272]:
# This will print more than 20 values records

print(sw[sw > 20])

tue    30
thr    25
fri    30
sat    40
dtype: int64

In [273]:
#  This will multiply each index with 2 and will also update the sereis 'sw'

sw * 2
sw = sw * 2
print(sw)

mon    40
tue    60
wed    40
thr    50
fri    60
sat    80
sun     0
dtype: int64

In [274]:
#  This will return boolean value to confirm availability of value in Pandas Series

'mon' in sw

True

# Creating Pandas Seriues by taking input from Numpy arrays

In [277]:
import numpy as np
ar = np.array([3,2,4,5,6])
ind = np.array( ['a', 'b', 'c', 'd', 'e'])

obj2 = pd.Series(ar, index = ind)
print(obj2)

a    3
b    2
c    4
d    5
e    6
dtype: int32

# Creating Pandas Series using Python Dictionery

In [278]:
salesData = {"Sindh": 35000, "Panjab": 4500, "KPK": 3000, "Balochistan": 2000}
tax_by_state = pd.Series(salesData)
print(tax_by_state)
print(tax_by_state.index)

Sindh          35000
Panjab          4500
KPK             3000
Balochistan     2000
dtype: int64
Index(['Sindh', 'Panjab', 'KPK', 'Balochistan'], dtype='object')

In [280]:
# Added another state 'GB' with no values and order of states is also changed


salesData = {"Sindh": 35000, "Panjab": 45000, "KPK": 30000, "Balochistan": 20000}
tax_by_state = pd.Series(salesData, index = ["Panjab", "Sindh", "KPK", "Balochistan", "GB"])
print(tax_by_state)

Panjab         45000.0
Sindh          35000.0
KPK            30000.0
Balochistan    20000.0
GB                 NaN
dtype: float64

In [281]:
# to check null values in Pandas Series

print(pd.isnull(tax_by_state))

Panjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

In [286]:
# Setting internal name of Pandas Series
# Setting index label / column name

tax_by_state.name= "state tax paying capicity"
tax_by_state.index.name = "states name"
print(tax_by_state)

states name
Panjab         45000.0
Sindh          35000.0
KPK            30000.0
Balochistan    20000.0
GB                 NaN
Name: state tax paying capicity, dtype: float64

In [288]:
#  to print indexes

print(tax_by_state.index)   # to print indexes

Index(['Panjab', 'Sindh', 'KPK', 'Balochistan', 'GB'], dtype='object', name='states name')

In [290]:
# NaN values mean, values does not exist in pandas series

pd.isnull(tax_by_state)

states name
Panjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
Name: state tax paying capicity, dtype: bool

In [291]:
#  Another way to check null values

tax_by_state.isnull()

states name
Panjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
Name: state tax paying capicity, dtype: bool

In [295]:
# Created pandas series

sw = pd.Series([20, 30, 20, 25, 30, 40, 0], 
               index = ['mon', 'tue', 'wed', 'thr','fri', 'sat', 'sun'])

print(sw)

mon    20
tue    30
wed    20
thr    25
fri    30
sat    40
sun     0
dtype: int64

In [296]:
# renamed row-indexes

sw.index = ["m", "t", "w", "t", "f", "s", "s"]
print(sw)

m    20
t    30
w    20
t    25
f    30
s    40
s     0
dtype: int64

# Pandas DataFrame Concepts

In [180]:
import numpy as np

In [181]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
data = {'state': state,
       'years': [2000, 2001, 2002, 2000, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [182]:
state

['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

In [183]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'years': [2000, 2001, 2002, 2000, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [184]:
state_pop_df = pd.DataFrame(data)

In [185]:
state_pop_df

    state  years  pop
0    Ohio   2000  1.5
1    Ohio   2001  1.7
2    Ohio   2002  3.6
3  Nevada   2000  2.4
4  Nevada   2001  2.9
5  Nevada   2002  3.2

In [186]:
# adding customized index names to each row

state_pop_df.index = ['1st', '2nd', '3rd', '4th', '5th', '6th']

In [187]:
# Now, row indexes are renamed

state_pop_df

      state  years  pop
1st    Ohio   2000  1.5
2nd    Ohio   2001  1.7
3rd    Ohio   2002  3.6
4th  Nevada   2000  2.4
5th  Nevada   2001  2.9
6th  Nevada   2002  3.2

In [188]:
state_pop_df[0:]

      state  years  pop
1st    Ohio   2000  1.5
2nd    Ohio   2001  1.7
3rd    Ohio   2002  3.6
4th  Nevada   2000  2.4
5th  Nevada   2001  2.9
6th  Nevada   2002  3.2

In [189]:
# this will select all rows from index 0 to 2 and index-2 will be exclusive

state_pop_df[0:2]

    state  years  pop
1st  Ohio   2000  1.5
2nd  Ohio   2001  1.7

In [190]:
# This will return top five rows of data-frame state_pop_df

state_pop_df.head()

      state  years  pop
1st    Ohio   2000  1.5
2nd    Ohio   2001  1.7
3rd    Ohio   2002  3.6
4th  Nevada   2000  2.4
5th  Nevada   2001  2.9

In [191]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
data = {'state': state,
       'years': [2000, 2001, 2002, 2000, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [192]:
# Selecting a single column from data-frame

state

['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

In [193]:
# printing dictionary 'data'

data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'years': [2000, 2001, 2002, 2000, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [194]:
# sorting the columns order 
# here, second column 'years' is placed at first order

state_pop_df = pd.DataFrame(data, columns=['years', 'state', 'pop'])

In [195]:
print(state_pop_df)

   years   state  pop
0   2000    Ohio  1.5
1   2001    Ohio  1.7
2   2002    Ohio  3.6
3   2000  Nevada  2.4
4   2001  Nevada  2.9
5   2002  Nevada  3.2

In [196]:
# renaming the row-indexs of data-frame state_pop_df

state_pop_df.index = ['1st', '2nd', '3rd', '4th', '5th', '6th']

In [197]:
state_pop_df

     years   state  pop
1st   2000    Ohio  1.5
2nd   2001    Ohio  1.7
3rd   2002    Ohio  3.6
4th   2000  Nevada  2.4
5th   2001  Nevada  2.9
6th   2002  Nevada  3.2

In [201]:
# Adding an empty column at desired plase of data-frame i.e. frame2, in this case at last

frame2 = pd.DataFrame(data, columns=['years', 'state', 'pop', 'debt'])

In [203]:
# renaming row-indexes of data-frame i.e. frame2

frame2.index = ['1st', '2nd', '3rd', '4th', '5th', '6th']

In [ ]:
frame2

In [ ]:
# This will return top-five rows of data-frame i.e. frame2

frame2.head()

In [ ]:
# This will return top-three rows of data-frame i.e. frame2 using head method.

frame2.head(3)

In [ ]:
# This will return top-six rows of data-frame i.e. frame2 using head method.

frame2.head(6)

In [ ]:
# This will print the columns / keys of data-frame i.e. frame2

print(frame2.columns)

In [ ]:
# This will print values of frame2 data-frame

frame2.values

In [ ]:
# This will print all indexes of rows of data-frame i.e. frame2
frame2.index

# Accessing column by method 'Dictionery Like'

In [ ]:
# Accessing desired column of dictionery

data['years']

In [ ]:
# Accessing desired column of data frame i.e. frame2
frame2['years']

# Accessing columns by method 'Attribute Like'

In [ ]:
# This method can only apply on pandas data-frame type objects
# Column name is placed as 'Attribute' after the name of data-frame

frame2.years

In [ ]:
frame2.state

# Using 'loc' method to access data from a Pandas DataFrame

In [ ]:
# this will return data / row of specific index from the DataFrame i.e. frame2

frame2.loc['5th']

# this is the data of last recrod of dataframe frame2 which is at index-5 whose index name is '5th'

# Populating the values in empty column

In [ ]:
# Original value of frame2

print(frame2)

In [221]:
# finding and saving length of rows / indexes of frmae2
lengthOfFrame2 = len(frame2)
print('No of rows in frame2: ' + str(lengthOfFrame2))

# creating an array equal to length of frame2
rng = np.arange(lengthOfFrame2)

# assigning the array to a new variable 'valueOfColumnDebt'
valuesOfColumnDebt = rng 

# this will populate the value in empty column 'debt' by adding '15' 
frame2['debt'] = (valuesOfColumnDebt + 15)
print(frame2)

No of rows in frame2: 6
     years   state  pop  debt
1st   2000    Ohio  1.5    15
2nd   2001    Ohio  1.7    16
3rd   2002    Ohio  3.6    17
4th   2000  Nevada  2.4    18
5th   2001  Nevada  2.9    19
6th   2002  Nevada  3.2    20

# Populating a Column Using Series

In [222]:
# current state of data-frame i.e. frame2

frame2

     years   state  pop  debt
1st   2000    Ohio  1.5    15
2nd   2001    Ohio  1.7    16
3rd   2002    Ohio  3.6    17
4th   2000  Nevada  2.4    18
5th   2001  Nevada  2.9    19
6th   2002  Nevada  3.2    20

In [227]:
# created a new variable using 'series' to store values to be inserted into data-frame i.e. frame2

valueOfColumnDebt = pd.Series([14, 56, 23, 87, 35, 46], index=['1st', '2nd', '3rd', '4th', '5th', '6th'])
valueOfColumnDebt

1st    14
2nd    56
3rd    23
4th    87
5th    35
6th    46
dtype: int64

In [228]:
# Assigned values of variable 'valueOfColumnDebt' to column 'debt' of data-frame i.e. frame2

frame2['debt'] = valueOfColumnDebt

In [229]:
# Now, the state of frame2 after populating fresh values into column 'debt'

frame2

     years   state  pop  debt
1st   2000    Ohio  1.5    14
2nd   2001    Ohio  1.7    56
3rd   2002    Ohio  3.6    23
4th   2000  Nevada  2.4    87
5th   2001  Nevada  2.9    35
6th   2002  Nevada  3.2    46

# Populating only selected fields of a Column

In [230]:
# current state of data-frame i.e. frame2

frame2

     years   state  pop  debt
1st   2000    Ohio  1.5    14
2nd   2001    Ohio  1.7    56
3rd   2002    Ohio  3.6    23
4th   2000  Nevada  2.4    87
5th   2001  Nevada  2.9    35
6th   2002  Nevada  3.2    46

In [233]:
# Creating a new series

newValuesOfColDebt = pd.Series([150, 80,280], index=['2nd','4th','6th'])

In [234]:
# Now we will insert these new values into column 'debt'

frame2['debt'] = newValuesOfColDebt

In [237]:
# Now, the state of frame2 after populating fresh values into column 'debt'
# Here, row-1, row-3, and row-5 will present 'NaN' in column 'debt' because only row-2, row-4 and row-6 has been updated

frame2

     years   state  pop   debt
1st   2000    Ohio  1.5    NaN
2nd   2001    Ohio  1.7  150.0
3rd   2002    Ohio  3.6    NaN
4th   2000  Nevada  2.4   80.0
5th   2001  Nevada  2.9    NaN
6th   2002  Nevada  3.2  280.0